In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    'one':pd.Series(np.random.randn(3), index=['a','b','c']),
    'two':pd.Series(np.random.randn(4),index=['a','b','c','d']),
    'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [4]:
df

        one       two     three
a  1.473960  1.238212       NaN
b -0.031568 -1.038520  0.229267
c  0.295976  1.893605  0.498691
d       NaN  0.528795 -0.800383

In [5]:
df2 = df.copy()

In [6]:
df2

        one       two     three
a  1.473960  1.238212       NaN
b -0.031568 -1.038520  0.229267
c  0.295976  1.893605  0.498691
d       NaN  0.528795 -0.800383

In [9]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [10]:
df.ne(df2)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [11]:
(df >0).all()

one      False
two      False
three    False
dtype: bool

In [12]:
(df>0).any()

one      True
two      True
three    True
dtype: bool

In [13]:
(df > 0 ).any().any()

True

In [14]:
df and df2

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

<h2>You can do element wise comparison</h2>

In [15]:
pd.Series(['foo','bar','baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [20]:
pd.Series(['foo','bar','baz']) == pd.Index(['foo','bar','qux'])

0     True
1     True
2    False
dtype: bool

In [24]:
df_sum = df + df
df_sum

        one       two     three
a  2.947919  2.476425       NaN
b -0.063136 -2.077040  0.458535
c  0.591951  3.787209  0.997382
d       NaN  1.057590 -1.600766

In [26]:
df_times_two = df * 2
df_times_two

        one       two     three
a  2.947919  2.476425       NaN
b -0.063136 -2.077040  0.458535
c  0.591951  3.787209  0.997382
d       NaN  1.057590 -1.600766

In [27]:
df_sum == df_times_two

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [28]:
(df+df) == (df *2)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [31]:
(df + df == df*2).all()

one      False
two       True
three    False
dtype: bool

In [32]:
(df + df).equals(df*2)

True

In [34]:
df

        one       two     three
a  1.473960  1.238212       NaN
b -0.031568 -1.038520  0.229267
c  0.295976  1.893605  0.498691
d       NaN  0.528795 -0.800383

In [35]:
print(df.mean(0),"\n")
print(df.mean(1))

one      0.579456
two      0.655523
three   -0.024142
dtype: float64

a    1.356086
b   -0.280273
c    0.896090
d   -0.135794
dtype: float64

In [36]:
df.mean()

one      0.579456
two      0.655523
three   -0.024142
dtype: float64

In [39]:
ts_stand = (df-df.mean())/df.std()
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

In [40]:
series = pd.Series(np.random.randn(1000))

In [43]:
series[::2] = np.nan
series

0           NaN
1     -1.893922
2           NaN
3     -0.523767
4           NaN
         ...
995   -0.157246
996         NaN
997    0.223869
998         NaN
999    1.138685
Length: 1000, dtype: float64

In [44]:
series.describe()

count    500.000000
mean      -0.008718
std        1.031655
min       -2.490790
25%       -0.624919
50%       -0.089700
75%        0.677621
max        2.993498
dtype: float64

In [48]:
frame = pd.DataFrame(np.random.randn(1000,5),columns=['a','b','c','d','e'])

In [49]:
frame.iloc[::2] = np.nan

In [50]:
fram.describe()

                 a            b            c            d            e
count  1000.000000  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034521    -0.012748     0.023891    -0.034724    -0.017856
std       1.000894     1.017412     1.019913     0.969091     1.019925
min      -3.854856    -3.321334    -3.759696    -2.967157    -3.053422
25%      -0.639839    -0.692454    -0.687949    -0.734083    -0.737872
50%       0.058924     0.000417     0.024617    -0.016762    -0.019745
75%       0.715435     0.676147     0.699531     0.627292     0.642526
max       3.063617     3.227293     4.023772     3.700652     3.730600

In [52]:
s = pd.Series(['a','a','b','b','a',np.nan,'c','d','a'])
s.describe()

count     8
unique    4
top       a
freq      4
dtype: object

In [56]:
s1 = pd.Series(np.random.randn(5))
s1

0   -0.266243
1    2.120379
2   -0.045570
3    1.069313
4    1.192123
dtype: float64

In [57]:
s1.idxmin(), s1.idxmax()

(0, 1)

In [58]:
df1 = pd.DataFrame(np.random.randn(5,3),columns=['A','B','C'])
df1

          A         B         C
0  0.279543 -0.675811  1.573609
1 -0.358486  1.149871 -0.298395
2  0.513841 -0.204818 -0.057961
3 -1.168929 -0.846440  0.434145
4 -0.317455  0.635676  1.389292

In [59]:
df1.idxmin(axis=0)

A    3
B    3
C    1
dtype: int64

In [60]:
df1.idxmax(axis=1)

0    C
1    B
2    A
3    C
4    C
dtype: object

In [67]:
df = pd.DataFrame({'col1': np.random.randn(3),
                     'col2': np.random.randn(3)}, index=['a', 'b', 'c'])
df

       col1      col2
a -0.237069 -0.098056
b  1.280792 -1.630378
c -0.684694 -0.069996

In [65]:
for col in df.items():
    print(col)

('col1', a   -0.377163
b    0.375576
c   -0.160214
Name: col1, dtype: float64)
('col2', a   -1.068285
b    0.503978
c   -0.721656
Name: col2, dtype: float64)

In [66]:
for col in df.iterrows():
    print(col)

('a', col1   -0.377163
col2   -1.068285
Name: a, dtype: float64)
('b', col1    0.375576
col2    0.503978
Name: b, dtype: float64)
('c', col1   -0.160214
col2   -0.721656
Name: c, dtype: float64)

In [68]:
for col in df.itertuples():
    print(col)

Pandas(Index='a', col1=-0.23706851223242495, col2=-0.09805626635488444)
Pandas(Index='b', col1=1.2807918950231538, col2=-1.6303777554969798)
Pandas(Index='c', col1=-0.6846944198975679, col2=-0.06999642017381338)

In [69]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': ['a', 'b', 'c']})

In [70]:
df

   a  b
0  1  a
1  2  b
2  3  c

In [71]:
for label, ser in df.items():
    print(label)
    print(ser)

a
0    1
1    2
2    3
Name: a, dtype: int64
b
0    a
1    b
2    c
Name: b, dtype: object

In [72]:
for row_index, row in df.iterrows():
        print(row_index, row, sep='\n')

0
a    1
b    a
Name: 0, dtype: object
1
a    2
b    b
Name: 1, dtype: object
2
a    3
b    c
Name: 2, dtype: object

In [73]:
df.iterrows()

In [74]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, a=1, b='a')
Pandas(Index=1, a=2, b='b')
Pandas(Index=2, a=3, b='c')